export const elementConfig = {
  id: "",
  productName: "内孤立波预报产品",
  elementName: "海水温度",
  source: "课题3.4",
  unit: "℃",

  levelDefault: 2.5,
  level: [
    2.5, 7.6597, 13.149, 18.989, 25.202, 31.812, 38.844, 46.324, 54.283, 62.75, 71.757, 81.338, 91.531, 102.37, 113.91, 126.17, 139.22, 153.1, 167.86, 183.55,
    200.24, 217.99, 236.85, 256.9, 278.22, 300.86, 324.92, 350.48, 377.62, 406.43, 437.01, 469.44, 503.84, 540.29, 578.91, 619.8, 663.05, 708.78, 757.08,
    808.05, 861.79, 918.37, 977.89, 1040.4, 1106, 1174.6, 1246.4, 1321.4, 1399.5, 1480.7, 1564.9, 1652.2, 1742.5, 1835.6, 1931.4, 2029.9, 2130.8, 2234.1,
    2339.7, 2447.3, 2556.8, 2668.1, 2781, 2895.4, 3011.1, 3128.1, 3246.2, 3365.3, 3485.3, 3606.1, 3727.7, 3849.8, 3972.6, 4095.8, 4219.5, 4343.6, 4468, 4592.8,
    4717.8, 4843.1, 4968.5, 5094.2, 5220, 5346, 5472.1, 5598.3, 5724.6, 5851, 5977.5, 6104,
  ],

  bboxDefault: [115.802393355, 123.915865971, 17.802393355, 22.392847773],

  sampleDefault: 1,
  sampleArr: [
    {
      label: 1,
      value: 1,
    },
    {
      label: 2,
      value: 2,
    },
    {
      label: 3,
      value: 3,
    },
    {
      label: 4,
      value: 4,
    },
    {
      label: 5,
      value: 5,
    },
  ],

  timeSpan: ["2025-04-22 00:00:00", "2025-05-22 00:00:00"],
  timeResolution: 60 * 60, // 按秒计算，逐小时预报

  resultTypeDefault: "nc",
  resultTypeArr: [
    {
      label: "填色图",
      value: "nc",
    },
    {
      label: "网格图",
      value: "h3",
    },
    {
      label: "等值线",
      value: "isoline",
    },
  ],

  h3ResolutionDefault: 5,
  h3ResolutionArr: [
    {
      label: "3级",
      value: 3,
    },
    {
      label: "4级",
      value: 4,
    },
    {
      label: "5级",
      value: 5,
    },
    {
      label: "6级",
      value: 6,
    },
    {
      label: "7级",
      value: 7,
    },
  ],

  colorDefault: "interpolateTurbo",
  colorArr: ["interpolateTurbo"],

  minValue: 0,
  maxValue: 40,
};
